/* Status message appended to the chat view when a player is kicked from the server */
"%@ has been kicked from the server" = "%@ has been kicked from the server";

/* Placeholder for informational text when a server refuses the user's login, but provides no reason with the rejection message */
"(No reason given)" = "(No reason given)";

/* Informative text prefixing information displayed on an alert describing a generic connection error */
"A connection error occurred:" = "A connection error occurred:";

/* Informative text on alert displayed when the user attempts to disconnect from a server while participating in a game */
"A game is currently in progress. Are you sure you want to disconnect from the server?" = "A game is currently in progress. Are you sure you want to disconnect from the server?";

/* Informative text prefixing information displayed on an alert describing a local network problem */
"A local network error occurred:" = "A local network error occurred:";

/* Informative text on alert displayed when a DNS lookup causes an error, prior to the error code */
"An error occurred while trying to find the server." = "An error occurred while trying to find the server.";

/* Informative text on alert displayed when the user attempts to open a new server connection while playing an offline game */
"An offline game is currently in progress. Before you can connect to a server, you will have to forfeit the game. Are you sure you want to do this?" = "An offline game is currently in progress. Before you can connect to a server, you will have to forfeit the game. Are you sure you want to do this?";

/* Informative text prefixing information about an unknown connection error */
"An unknown error occurred:" = "An unknown error occurred:";

/* Title of toolbar button used to cancel when attempting to open a connection to a server */
"Cancel Connection" = "Cancel Connection";

/* Title of menu item used to cancel when attempting to open a connection to a server */
"Cancel Connection in Progress" = "Cancel Connection in Progress";

/* After a connection error message, suggestion that the user check his or her computer's network state and the server address before retrying */
"Check that your computer is connected to the internet, or check the server address and try again." = "Check that your computer is connected to the internet, or check the server address and try again.";

/* After a connection error message, suggestion that the user check that the host address is running a TetriNET server before retrying */
"Check the address of the server you are attempting to connect to and try again." = "Check the address of the server you are attempting to connect to and try again.";

/* Title of button or toolbar button used to open a connection to a server */
"Connect" = "Connect";

/* Title of 'connect to server' alert dialog */
"Connect to Server" = "Connect to Server";

/* Title of menu item used to open a connection to a server */
"Connect to Server..." = "Connect to Server...";

/* Status label displayed at bottom of window while connected to a server */
"Connected" = "Connected";

/* Status label displayed at bottom of window when a new connection is being opened to a server */
"Connecting to server %@..." = "Connecting to server %@...";

/* Status label displayed at the bottom of the window after cancelling a connection to a server */
"Connection canceled" = "Connection canceled";

/* Status message appended to the chat view after successfully disconnecting from a server */
"Connection Closed" = "Connection Closed";

/* Title of alert displayed when an error occurs while connecting or connected to a server */
"Connection error" = "Connection error";

/* Status message appended to the chat view if a connection error occurs */
"Connection Error" = "Connection Error";

/* Status label displayed at bottom of window if a connection error occurs */
"Connection error occurred" = "Connection error occurred";

/* Status message appended to the chat view after successfully opening a connection to a server */
"Connection Opened" = "Connection Opened";

/* Informative text on alert displayed in the event of a 'connection refused' error when connecting to a server */
"Connection refused." = "Connection refused.";

/* Informative text on alert displayed in the event that a DNS lookup on a server name returns no results */
"Could not find the server." = "Could not find the server.";

/* Informative text on alert displayed in the event of a 'host unreachable' error when connecting to a server */
"Could not open a connection to the server." = "Could not open a connection to the server.";

/* Title of menu item used to close an open connection to a server */
"Disconect from Server" = "Disconect from Server";

/* Title of button or toolbar button used to close an open connection to a server */
"Disconnect" = "Disconnect";

/* Status label displayed at bottom of window after successfully disconnecting from a server */
"Disconnected" = "Disconnected";

/* Status label displayed at bottom of window while disconnecting from a server */
"Disconnecting..." = "Disconnecting...";

/* Button on 'connect to server' alert dialog that cancels the connection and opens the preferences window to allow the user to edit the list of servers */
"Edit Server List..." = "Edit Server List...";

/* Label for the code of an unknown connection error */
"Error code: %d" = "Error code: %d";

/* Label for the domain of an unknown connection error */
"Error domain: %@" = "Error domain: %@";

/* Title of button on 'disconnect with game in progress?' alert that allows the user to stop playing and disconnect */
"Forfeit and Disconnect" = "Forfeit and Disconnect";

/* Title of button on 'connect with offline game in progress?' alert that allows the user to stop playing the offline game and open a connection to a server */
"Forfeit Game" = "Forfeit Game";

/* Status label displayed at bottom of window while logging in to a server */
"Logging in as %@..." = "Logging in as %@...";

/* Informative text on 'connect to server' alert dialog, prompting the user to select a server to connect to */
"Select a server to connect to:" = "Select a server to connect to:";

/* Status label displayed at bottom of window when the server closes the remote end of the connection */
"Server closed connection" = "Server closed connection";

/* Informative text prefixing a reason received from a server when it won't allow the user to log in */
"Server refused login:" = "Server refused login:";

/* Informative text on alert displayed when connecting to a server fails due to timeout */
"The connection timed out." = "The connection timed out.";

/* Status message appended to the chat view when the server informs the client that it is about to be disconnected */
"You have been kicked from the server" = "You have been kicked from the server";

